TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_aesadvhp.h
/* AESADVHP_INT_EVENT2_ICLR Bits */
/* AESADVHP_INT_EVENT2_ICLR[TRIG1] Bits */
#define AESADVHP_INT_EVENT2_ICLR_TRIG1_OFS       (0)                             /* !< TRIG1 Offset */
#define AESADVHP_INT_EVENT2_ICLR_TRIG1_MASK      ((uint32_t)0x00000001U)         /* !< TRIG1 event */
#define AESADVHP_INT_EVENT2_ICLR_TRIG1_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define AESADVHP_INT_EVENT2_ICLR_TRIG1_CLR       ((uint32_t)0x00000001U)         /* !< Clear Interrupt */

/* AESADVHP_INT_EVENT1_IIDX Bits */
/* AESADVHP_INT_EVENT1_IIDX[STAT] Bits */
#define AESADVHP_INT_EVENT1_IIDX_STAT_OFS        (0)                             /* !< STAT Offset */
#define AESADVHP_INT_EVENT1_IIDX_STAT_MASK       ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define AESADVHP_INT_EVENT1_IIDX_STAT_NO_INTR    ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define AESADVHP_INT_EVENT1_IIDX_STAT_TRIG0      ((uint32_t)0x00000001U)         /* !< AES trigger 0 DMA (Data Input
                                                                                    trigger) */

/* AESADVHP_INT_EVENT1_IMASK Bits */
/* AESADVHP_INT_EVENT1_IMASK[TRIG0] Bits */
#define AESADVHP_INT_EVENT1_IMASK_TRIG0_OFS      (0)                             /* !< TRIG0 Offset */
#define AESADVHP_INT_EVENT1_IMASK_TRIG0_MASK     ((uint32_t)0x00000001U)         /* !< TRIG0 event mask. */
#define AESADVHP_INT_EVENT1_IMASK_TRIG0_CLR      ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADVHP_INT_EVENT1_IMASK_TRIG0_SET      ((uint32_t)0x00000001U)         /* !< Set Interrrupt Mask */

/* AESADVHP_INT_EVENT1_RIS Bits */
/* AESADVHP_INT_EVENT1_RIS[TRIG0] Bits */
#define AESADVHP_INT_EVENT1_RIS_TRIG0_OFS        (0)                             /* !< TRIG0 Offset */
#define AESADVHP_INT_EVENT1_RIS_TRIG0_MASK       ((uint32_t)0x00000001U)         /* !< TRIG0 event */
#define AESADVHP_INT_EVENT1_RIS_TRIG0_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define AESADVHP_INT_EVENT1_RIS_TRIG0_SET        ((uint32_t)0x00000001U)         /* !< Interrupt occured */

/* AESADVHP_INT_EVENT1_MIS Bits */
/* AESADVHP_INT_EVENT1_MIS[TRIG0] Bits */
#define AESADVHP_INT_EVENT1_MIS_TRIG0_OFS        (0)                             /* !< TRIG0 Offset */
#define AESADVHP_INT_EVENT1_MIS_TRIG0_MASK       ((uint32_t)0x00000001U)         /* !< TRIG0 event */
#define AESADVHP_INT_EVENT1_MIS_TRIG0_CLR        ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define AESADVHP_INT_EVENT1_MIS_TRIG0_SET        ((uint32_t)0x00000001U)         /* !< Interrupt occured */

/* AESADVHP_INT_EVENT1_ISET Bits */
/* AESADVHP_INT_EVENT1_ISET[TRIG0] Bits */
#define AESADVHP_INT_EVENT1_ISET_TRIG0_OFS       (0)                             /* !< TRIG0 Offset */
#define AESADVHP_INT_EVENT1_ISET_TRIG0_MASK      ((uint32_t)0x00000001U)         /* !< TRIG0 */
#define AESADVHP_INT_EVENT1_ISET_TRIG0_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define AESADVHP_INT_EVENT1_ISET_TRIG0_SET       ((uint32_t)0x00000001U)         /* !< Set Interrupt */

/* AESADVHP_INT_EVENT1_ICLR Bits */
/* AESADVHP_INT_EVENT1_ICLR[TRIG0] Bits */
#define AESADVHP_INT_EVENT1_ICLR_TRIG0_OFS       (0)                             /* !< TRIG0 Offset */
#define AESADVHP_INT_EVENT1_ICLR_TRIG0_MASK      ((uint32_t)0x00000001U)         /* !< TRIG0 event */
#define AESADVHP_INT_EVENT1_ICLR_TRIG0_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define AESADVHP_INT_EVENT1_ICLR_TRIG0_CLR       ((uint32_t)0x00000001U)         /* !< Clear Interrupt */

/* AESADVHP_INT_EVENT0_IIDX Bits */
/* AESADVHP_INT_EVENT0_IIDX[STAT] Bits */
#define AESADVHP_INT_EVENT0_IIDX_STAT_OFS        (0)                             /* !< STAT Offset */
#define AESADVHP_INT_EVENT0_IIDX_STAT_MASK       ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define AESADVHP_INT_EVENT0_IIDX_STAT_NO_INTR    ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define AESADVHP_INT_EVENT0_IIDX_STAT_OUTPUTRDY  ((uint32_t)0x00000001U)         /* !< This indicates that the core has an
                                                                                    output available to be read out. This
                                                                                    should not be used if DMA handshake
                                                                                    is used (AES_DMA_HS.DMA_DATA_ACK set
                                                                                    to 1) */
#define AESADVHP_INT_EVENT0_IIDX_STAT_INPUTRDY   ((uint32_t)0x00000002U)         /* !< This indicates that the engine can
                                                                                    take new input. This should not be
                                                                                    used if DMA handshake is used
                                                                                    (AES_DMA_HS.DMA_DATA_ACK set to 1) */
#define AESADVHP_INT_EVENT0_IIDX_STAT_SAVEDCNTXTRDY ((uint32_t)0x00000003U)         /* !< This bit indicates that an AES
                                                                                    authentication TAG and/or IV block(s)
                                                                                    is/are available for the CPU to
                                                                                    retrieve. This bit is only asserted
                                                                                    if the save_context bit is set to 1b.
                                                                                    The bit is mutually exclusive with
                                                                                    the context_ready bit. */
#define AESADVHP_INT_EVENT0_IIDX_STAT_CNTXTRDY   ((uint32_t)0x00000004U)         /* !< This bit indicates that the context
                                                                                    data registers can be overwritten,
                                                                                    and the CPU is permitted to write new
                                                                                    context. */

