TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_aesadvhp.h
/* AESADVHP_INT_EVENT0_IMASK Bits */
/* AESADVHP_INT_EVENT0_IMASK[OUTPUTRDY] Bits */
#define AESADVHP_INT_EVENT0_IMASK_OUTPUTRDY_OFS  (0)                             /* !< OUTPUTRDY Offset */
#define AESADVHP_INT_EVENT0_IMASK_OUTPUTRDY_MASK ((uint32_t)0x00000001U)         /* !< This indicates that the core has an
                                                                                    output available to be read out. This
                                                                                    should not be used if DMA handshake
                                                                                    is used (AES_DMA_HS.DMA_DATA_ACK set
                                                                                    to 1) */
#define AESADVHP_INT_EVENT0_IMASK_OUTPUTRDY_CLR  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADVHP_INT_EVENT0_IMASK_OUTPUTRDY_SET  ((uint32_t)0x00000001U)         /* !< Set Interrrupt Mask */
/* AESADVHP_INT_EVENT0_IMASK[INPUTRDY] Bits */
#define AESADVHP_INT_EVENT0_IMASK_INPUTRDY_OFS   (1)                             /* !< INPUTRDY Offset */
#define AESADVHP_INT_EVENT0_IMASK_INPUTRDY_MASK  ((uint32_t)0x00000002U)         /* !< This indicates that the engine can
                                                                                    take new input. This should not be
                                                                                    used if DMA handshake is used
                                                                                    (AES_DMA_HS.DMA_DATA_ACK set to 1) */
#define AESADVHP_INT_EVENT0_IMASK_INPUTRDY_CLR   ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADVHP_INT_EVENT0_IMASK_INPUTRDY_SET   ((uint32_t)0x00000002U)         /* !< Set Interrrupt Mask */
/* AESADVHP_INT_EVENT0_IMASK[SAVEDCNTXTRDY] Bits */
#define AESADVHP_INT_EVENT0_IMASK_SAVEDCNTXTRDY_OFS (2)                             /* !< SAVEDCNTXTRDY Offset */
#define AESADVHP_INT_EVENT0_IMASK_SAVEDCNTXTRDY_MASK ((uint32_t)0x00000004U)         /* !< This bit indicates that an AES
                                                                                    authentication TAG and/or IV block(s)
                                                                                    is/are available for the CPU to
                                                                                    retrieve. This bit is only asserted
                                                                                    if the save_context bit is set to 1b.
                                                                                    The bit is mutually exclusive with
                                                                                    the context_ready bit. */
#define AESADVHP_INT_EVENT0_IMASK_SAVEDCNTXTRDY_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADVHP_INT_EVENT0_IMASK_SAVEDCNTXTRDY_SET ((uint32_t)0x00000004U)         /* !< Set Interrrupt Mask */
/* AESADVHP_INT_EVENT0_IMASK[CNTXTRDY] Bits */
#define AESADVHP_INT_EVENT0_IMASK_CNTXTRDY_OFS   (3)                             /* !< CNTXTRDY Offset */
#define AESADVHP_INT_EVENT0_IMASK_CNTXTRDY_MASK  ((uint32_t)0x00000008U)         /* !< This bit indicates that the context
                                                                                    data registers can be overwritten,
                                                                                    and the CPU is permitted to write
                                                                                    next context. */
#define AESADVHP_INT_EVENT0_IMASK_CNTXTRDY_CLR   ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADVHP_INT_EVENT0_IMASK_CNTXTRDY_SET   ((uint32_t)0x00000008U)         /* !< Set Interrrupt Mask */

/* AESADVHP_INT_EVENT0_RIS Bits */
/* AESADVHP_INT_EVENT0_RIS[OUTPUTRDY] Bits */
#define AESADVHP_INT_EVENT0_RIS_OUTPUTRDY_OFS    (0)                             /* !< OUTPUTRDY Offset */
#define AESADVHP_INT_EVENT0_RIS_OUTPUTRDY_MASK   ((uint32_t)0x00000001U)         /* !< This indicates that the core has an
                                                                                    output available to be read out. This
                                                                                    should not be used if DMA handshake
                                                                                    is used (AES_DMA_HS.DMA_DATA_ACK set
                                                                                    to 1) */
#define AESADVHP_INT_EVENT0_RIS_OUTPUTRDY_CLR    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define AESADVHP_INT_EVENT0_RIS_OUTPUTRDY_SET    ((uint32_t)0x00000001U)         /* !< Interrupt occured */
/* AESADVHP_INT_EVENT0_RIS[INPUTRDY] Bits */
#define AESADVHP_INT_EVENT0_RIS_INPUTRDY_OFS     (1)                             /* !< INPUTRDY Offset */
#define AESADVHP_INT_EVENT0_RIS_INPUTRDY_MASK    ((uint32_t)0x00000002U)         /* !< This indicates that the engine can
                                                                                    take new input. This should not be
                                                                                    used if DMA handshake is used
                                                                                    (AES_DMA_HS.DMA_DATA_ACK set to 1) */
#define AESADVHP_INT_EVENT0_RIS_INPUTRDY_CLR     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADVHP_INT_EVENT0_RIS_INPUTRDY_SET     ((uint32_t)0x00000002U)         /* !< Set Interrrupt Mask */
/* AESADVHP_INT_EVENT0_RIS[SAVEDCNTXTRDY] Bits */
#define AESADVHP_INT_EVENT0_RIS_SAVEDCNTXTRDY_OFS (2)                             /* !< SAVEDCNTXTRDY Offset */
#define AESADVHP_INT_EVENT0_RIS_SAVEDCNTXTRDY_MASK ((uint32_t)0x00000004U)         /* !< This bit indicates that an AES
                                                                                    authentication TAG and/or IV block(s)
                                                                                    is/are available for the CPU to
                                                                                    retrieve. This bit is only asserted
                                                                                    if the save_context bit is set to 1b.
                                                                                    The bit is mutually exclusive with
                                                                                    the context_ready bit. */
#define AESADVHP_INT_EVENT0_RIS_SAVEDCNTXTRDY_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADVHP_INT_EVENT0_RIS_SAVEDCNTXTRDY_SET ((uint32_t)0x00000004U)         /* !< Set Interrrupt Mask */
/* AESADVHP_INT_EVENT0_RIS[CNTXTRDY] Bits */
#define AESADVHP_INT_EVENT0_RIS_CNTXTRDY_OFS     (3)                             /* !< CNTXTRDY Offset */
#define AESADVHP_INT_EVENT0_RIS_CNTXTRDY_MASK    ((uint32_t)0x00000008U)         /* !< This bit indicates that the context
                                                                                    data registers can be overwritten,
                                                                                    and the CPU is permitted to write
                                                                                    next context. */
#define AESADVHP_INT_EVENT0_RIS_CNTXTRDY_CLR     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADVHP_INT_EVENT0_RIS_CNTXTRDY_SET     ((uint32_t)0x00000008U)         /* !< Set Interrrupt Mask */

/* AESADVHP_INT_EVENT0_MIS Bits */
/* AESADVHP_INT_EVENT0_MIS[OUTPUTRDY] Bits */
#define AESADVHP_INT_EVENT0_MIS_OUTPUTRDY_OFS    (0)                             /* !< OUTPUTRDY Offset */
#define AESADVHP_INT_EVENT0_MIS_OUTPUTRDY_MASK   ((uint32_t)0x00000001U)         /* !< This indicates that the core has an
                                                                                    output available to be read out. This
                                                                                    should not be used if DMA handshake
                                                                                    is used (AES_DMA_HS.DMA_DATA_ACK set
                                                                                    to 1) */
#define AESADVHP_INT_EVENT0_MIS_OUTPUTRDY_CLR    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define AESADVHP_INT_EVENT0_MIS_OUTPUTRDY_SET    ((uint32_t)0x00000001U)         /* !< Interrupt occured */
/* AESADVHP_INT_EVENT0_MIS[INPUTRDY] Bits */
#define AESADVHP_INT_EVENT0_MIS_INPUTRDY_OFS     (1)                             /* !< INPUTRDY Offset */
#define AESADVHP_INT_EVENT0_MIS_INPUTRDY_MASK    ((uint32_t)0x00000002U)         /* !< This indicates that the engine can
                                                                                    take new input. This should not be
                                                                                    used if DMA handshake is used
                                                                                    (AES_DMA_HS.DMA_DATA_ACK set to 1) */
#define AESADVHP_INT_EVENT0_MIS_INPUTRDY_CLR     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADVHP_INT_EVENT0_MIS_INPUTRDY_SET     ((uint32_t)0x00000002U)         /* !< Set Interrrupt Mask */
/* AESADVHP_INT_EVENT0_MIS[SAVEDCNTXTRDY] Bits */
#define AESADVHP_INT_EVENT0_MIS_SAVEDCNTXTRDY_OFS (2)                             /* !< SAVEDCNTXTRDY Offset */
#define AESADVHP_INT_EVENT0_MIS_SAVEDCNTXTRDY_MASK ((uint32_t)0x00000004U)         /* !< This bit indicates that an AES
                                                                                    authentication TAG and/or IV block(s)
                                                                                    is/are available for the CPU to
                                                                                    retrieve. This bit is only asserted
                                                                                    if the save_context bit is set to 1b.
                                                                                    The bit is mutually exclusive with
                                                                                    the context_ready bit. */
#define AESADVHP_INT_EVENT0_MIS_SAVEDCNTXTRDY_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADVHP_INT_EVENT0_MIS_SAVEDCNTXTRDY_SET ((uint32_t)0x00000004U)         /* !< Set Interrrupt Mask */
/* AESADVHP_INT_EVENT0_MIS[CNTXTRDY] Bits */
#define AESADVHP_INT_EVENT0_MIS_CNTXTRDY_OFS     (3)                             /* !< CNTXTRDY Offset */
#define AESADVHP_INT_EVENT0_MIS_CNTXTRDY_MASK    ((uint32_t)0x00000008U)         /* !< This bit indicates that the context
                                                                                    data registers can be overwritten,
                                                                                    and the CPU is permitted to write
                                                                                    next context. */
#define AESADVHP_INT_EVENT0_MIS_CNTXTRDY_CLR     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADVHP_INT_EVENT0_MIS_CNTXTRDY_SET     ((uint32_t)0x00000008U)         /* !< Set Interrrupt Mask */

/* AESADVHP_INT_EVENT0_ISET Bits */
/* AESADVHP_INT_EVENT0_ISET[OUTPUTRDY] Bits */
#define AESADVHP_INT_EVENT0_ISET_OUTPUTRDY_OFS   (0)                             /* !< OUTPUTRDY Offset */
#define AESADVHP_INT_EVENT0_ISET_OUTPUTRDY_MASK  ((uint32_t)0x00000001U)         /* !< This indicates that the core has an
                                                                                    output available to be read out. This
                                                                                    should not be used if DMA handshake
                                                                                    is used (AES_DMA_HS.DMA_DATA_ACK set
                                                                                    to 1) */
#define AESADVHP_INT_EVENT0_ISET_OUTPUTRDY_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define AESADVHP_INT_EVENT0_ISET_OUTPUTRDY_SET   ((uint32_t)0x00000001U)         /* !< Set Interrupt */
/* AESADVHP_INT_EVENT0_ISET[INPUTRDY] Bits */
#define AESADVHP_INT_EVENT0_ISET_INPUTRDY_OFS    (1)                             /* !< INPUTRDY Offset */
#define AESADVHP_INT_EVENT0_ISET_INPUTRDY_MASK   ((uint32_t)0x00000002U)         /* !< This indicates that the engine can
                                                                                    take new input.This should not be
                                                                                    used if DMA handshake is used
                                                                                    (AES_DMA_HS.DMA_DATA_ACK set to 1) */
#define AESADVHP_INT_EVENT0_ISET_INPUTRDY_CLR    ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADVHP_INT_EVENT0_ISET_INPUTRDY_SET    ((uint32_t)0x00000002U)         /* !< Set Interrrupt Mask */
/* AESADVHP_INT_EVENT0_ISET[SAVEDCNTXTRDY] Bits */
#define AESADVHP_INT_EVENT0_ISET_SAVEDCNTXTRDY_OFS (2)                             /* !< SAVEDCNTXTRDY Offset */
#define AESADVHP_INT_EVENT0_ISET_SAVEDCNTXTRDY_MASK ((uint32_t)0x00000004U)         /* !< This bit indicates that an AES
                                                                                    authentication TAG and/or IV block(s)
                                                                                    is/are available for the CPU to
                                                                                    retrieve. This bit is only asserted
                                                                                    if the save_context bit is set to 1b.
                                                                                    The bit is mutually exclusive with
                                                                                    the context_ready bit. */
#define AESADVHP_INT_EVENT0_ISET_SAVEDCNTXTRDY_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADVHP_INT_EVENT0_ISET_SAVEDCNTXTRDY_SET ((uint32_t)0x00000004U)         /* !< Set Interrrupt Mask */
/* AESADVHP_INT_EVENT0_ISET[CNTXTRDY] Bits */
#define AESADVHP_INT_EVENT0_ISET_CNTXTRDY_OFS    (3)                             /* !< CNTXTRDY Offset */
#define AESADVHP_INT_EVENT0_ISET_CNTXTRDY_MASK   ((uint32_t)0x00000008U)         /* !< This bit indicates that the context
                                                                                    data registers can be overwritten,
                                                                                    and the CPU is permitted to write
                                                                                    next context. */
#define AESADVHP_INT_EVENT0_ISET_CNTXTRDY_CLR    ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADVHP_INT_EVENT0_ISET_CNTXTRDY_SET    ((uint32_t)0x00000008U)         /* !< Set Interrrupt Mask */

/* AESADVHP_INT_EVENT0_ICLR Bits */
/* AESADVHP_INT_EVENT0_ICLR[OUTPUTRDY] Bits */
#define AESADVHP_INT_EVENT0_ICLR_OUTPUTRDY_OFS   (0)                             /* !< OUTPUTRDY Offset */
#define AESADVHP_INT_EVENT0_ICLR_OUTPUTRDY_MASK  ((uint32_t)0x00000001U)         /* !< This indicates that the core has an
                                                                                    output available to be read out. This
                                                                                    should not be used if DMA handshake
                                                                                    is used (AES_DMA_HS.DMA_DATA_ACK set
                                                                                    to 1) */
#define AESADVHP_INT_EVENT0_ICLR_OUTPUTRDY_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define AESADVHP_INT_EVENT0_ICLR_OUTPUTRDY_CLR   ((uint32_t)0x00000001U)         /* !< Clear Interrupt */
/* AESADVHP_INT_EVENT0_ICLR[INPUTRDY] Bits */
#define AESADVHP_INT_EVENT0_ICLR_INPUTRDY_OFS    (1)                             /* !< INPUTRDY Offset */
#define AESADVHP_INT_EVENT0_ICLR_INPUTRDY_MASK   ((uint32_t)0x00000002U)         /* !< This indicates that the engine can
                                                                                    take new input. This should not be
                                                                                    used if DMA handshake is used
                                                                                    (AES_DMA_HS.DMA_DATA_ACK set to 1) */
#define AESADVHP_INT_EVENT0_ICLR_INPUTRDY_CLR    ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADVHP_INT_EVENT0_ICLR_INPUTRDY_SET    ((uint32_t)0x00000002U)         /* !< Set Interrrupt Mask */
/* AESADVHP_INT_EVENT0_ICLR[SAVEDCNTXTRDY] Bits */
#define AESADVHP_INT_EVENT0_ICLR_SAVEDCNTXTRDY_OFS (2)                             /* !< SAVEDCNTXTRDY Offset */
#define AESADVHP_INT_EVENT0_ICLR_SAVEDCNTXTRDY_MASK ((uint32_t)0x00000004U)         /* !< This bit indicates that an AES
                                                                                    authentication TAG and/or IV block(s)
                                                                                    is/are available for the CPU to
                                                                                    retrieve. This bit is only asserted
                                                                                    if the save_context bit is set to 1b.
                                                                                    The bit is mutually exclusive with
                                                                                    the context_ready bit. */
#define AESADVHP_INT_EVENT0_ICLR_SAVEDCNTXTRDY_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADVHP_INT_EVENT0_ICLR_SAVEDCNTXTRDY_SET ((uint32_t)0x00000004U)         /* !< Set Interrrupt Mask */
/* AESADVHP_INT_EVENT0_ICLR[CNTXTRDY] Bits */
#define AESADVHP_INT_EVENT0_ICLR_CNTXTRDY_OFS    (3)                             /* !< CNTXTRDY Offset */
#define AESADVHP_INT_EVENT0_ICLR_CNTXTRDY_MASK   ((uint32_t)0x00000008U)         /* !< This bit indicates that the context
                                                                                    data registers can be overwritten,
                                                                                    and the CPU is permitted to write
                                                                                    next context. */
#define AESADVHP_INT_EVENT0_ICLR_CNTXTRDY_CLR    ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define AESADVHP_INT_EVENT0_ICLR_CNTXTRDY_SET    ((uint32_t)0x00000008U)         /* !< Set Interrrupt Mask */

