TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_aesadvhp.h
/* AESADVHP_PWREN Bits */
/* AESADVHP_PWREN[ENABLE] Bits */
#define AESADVHP_PWREN_ENABLE_OFS                (0)                             /* !< ENABLE Offset */
#define AESADVHP_PWREN_ENABLE_MASK               ((uint32_t)0x00000001U)         /* !< Enable the power */
#define AESADVHP_PWREN_ENABLE_DISABLE            ((uint32_t)0x00000000U)         /* !< Disable Power */
#define AESADVHP_PWREN_ENABLE_ENABLE             ((uint32_t)0x00000001U)         /* !< Enable Power */
/* AESADVHP_PWREN[KEY] Bits */
#define AESADVHP_PWREN_KEY_OFS                   (24)                            /* !< KEY Offset */
#define AESADVHP_PWREN_KEY_MASK                  ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define AESADVHP_PWREN_KEY_UNLOCK_W              ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* AESADVHP_RSTCTL Bits */
/* AESADVHP_RSTCTL[RESETSTKYCLR] Bits */
#define AESADVHP_RSTCTL_RESETSTKYCLR_OFS         (1)                             /* !< RESETSTKYCLR Offset */
#define AESADVHP_RSTCTL_RESETSTKYCLR_MASK        ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define AESADVHP_RSTCTL_RESETSTKYCLR_NOP         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define AESADVHP_RSTCTL_RESETSTKYCLR_CLR         ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* AESADVHP_RSTCTL[RESETASSERT] Bits */
#define AESADVHP_RSTCTL_RESETASSERT_OFS          (0)                             /* !< RESETASSERT Offset */
#define AESADVHP_RSTCTL_RESETASSERT_MASK         ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define AESADVHP_RSTCTL_RESETASSERT_NOP          ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define AESADVHP_RSTCTL_RESETASSERT_ASSERT       ((uint32_t)0x00000001U)         /* !< Assert reset */
/* AESADVHP_RSTCTL[KEY] Bits */
#define AESADVHP_RSTCTL_KEY_OFS                  (24)                            /* !< KEY Offset */
#define AESADVHP_RSTCTL_KEY_MASK                 ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define AESADVHP_RSTCTL_KEY_UNLOCK_W             ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* AESADVHP_STAT Bits */
/* AESADVHP_STAT[RESETSTKY] Bits */
#define AESADVHP_STAT_RESETSTKY_OFS              (16)                            /* !< RESETSTKY Offset */
#define AESADVHP_STAT_RESETSTKY_MASK             ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define AESADVHP_STAT_RESETSTKY_NORES            ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define AESADVHP_STAT_RESETSTKY_RESET            ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */

/* AESADVHP_CPU_CONNECT_0 Bits */
/* AESADVHP_CPU_CONNECT_0[CPUSS0_CONN] Bits */
#define AESADVHP_CPU_CONNECT_0_CPUSS0_CONN_OFS   (1)                             /* !< CPUSS0_CONN Offset */
#define AESADVHP_CPU_CONNECT_0_CPUSS0_CONN_MASK  ((uint32_t)0x00000002U)         /* !< CPUSS0 connect bit. */
#define AESADVHP_CPU_CONNECT_0_CPUSS0_CONN_UNCONNECTED ((uint32_t)0x00000000U)         /* !< The CPU is not connected. */
#define AESADVHP_CPU_CONNECT_0_CPUSS0_CONN_CONNECTED ((uint32_t)0x00000002U)         /* !< The CPU is connected. */

/* AESADVHP_PDBGCTL Bits */
/* AESADVHP_PDBGCTL[FREE] Bits */
#define AESADVHP_PDBGCTL_FREE_OFS                (0)                             /* !< FREE Offset */
#define AESADVHP_PDBGCTL_FREE_MASK               ((uint32_t)0x00000001U)         /* !< Free run control */
#define AESADVHP_PDBGCTL_FREE_RUN                ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */

/* AESADVHP_EVT_MODE Bits */
/* AESADVHP_EVT_MODE[INT0_CFG] Bits */
#define AESADVHP_EVT_MODE_INT0_CFG_OFS           (0)                             /* !< INT0_CFG Offset */
#define AESADVHP_EVT_MODE_INT0_CFG_MASK          ((uint32_t)0x00000003U)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.INT_EVENT0] */
#define AESADVHP_EVT_MODE_INT0_CFG_DISABLE       ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define AESADVHP_EVT_MODE_INT0_CFG_SOFTWARE      ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define AESADVHP_EVT_MODE_INT0_CFG_HARDWARE      ((uint32_t)0x00000002U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */
/* AESADVHP_EVT_MODE[EVT1_CFG] Bits */
#define AESADVHP_EVT_MODE_EVT1_CFG_OFS           (2)                             /* !< EVT1_CFG Offset */
#define AESADVHP_EVT_MODE_EVT1_CFG_MASK          ((uint32_t)0x0000000CU)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.INT_EVENT1] */
#define AESADVHP_EVT_MODE_EVT1_CFG_DISABLE       ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define AESADVHP_EVT_MODE_EVT1_CFG_SOFTWARE      ((uint32_t)0x00000004U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define AESADVHP_EVT_MODE_EVT1_CFG_HARDWARE      ((uint32_t)0x00000008U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */
/* AESADVHP_EVT_MODE[EVT2_CFG] Bits */
#define AESADVHP_EVT_MODE_EVT2_CFG_OFS           (4)                             /* !< EVT2_CFG Offset */
#define AESADVHP_EVT_MODE_EVT2_CFG_MASK          ((uint32_t)0x00000030U)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.INT_EVENT2] */
#define AESADVHP_EVT_MODE_EVT2_CFG_DISABLE       ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define AESADVHP_EVT_MODE_EVT2_CFG_SOFTWARE      ((uint32_t)0x00000010U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define AESADVHP_EVT_MODE_EVT2_CFG_HARDWARE      ((uint32_t)0x00000020U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */

/* AESADVHP_GCMCCM_TAG0 Bits */
/* AESADVHP_GCMCCM_TAG0[DATA] Bits */
#define AESADVHP_GCMCCM_TAG0_DATA_OFS            (0)                             /* !< DATA Offset */
#define AESADVHP_GCMCCM_TAG0_DATA_MASK           ((uint32_t)0xFFFFFFFFU)         /* !< Key data */

/* AESADVHP_GCMCCM_TAG1 Bits */
/* AESADVHP_GCMCCM_TAG1[DATA] Bits */
#define AESADVHP_GCMCCM_TAG1_DATA_OFS            (0)                             /* !< DATA Offset */
#define AESADVHP_GCMCCM_TAG1_DATA_MASK           ((uint32_t)0xFFFFFFFFU)         /* !< Key data */

