TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_aesadvhp.h
/* AESADVHP_DATA2 Bits */
/* AESADVHP_DATA2[DATA] Bits */
#define AESADVHP_DATA2_DATA_OFS                  (0)                             /* !< DATA Offset */
#define AESADVHP_DATA2_DATA_MASK                 ((uint32_t)0xFFFFFFFFU)         /* !< Data */

/* AESADVHP_DATA3 Bits */
/* AESADVHP_DATA3[DATA] Bits */
#define AESADVHP_DATA3_DATA_OFS                  (0)                             /* !< DATA Offset */
#define AESADVHP_DATA3_DATA_MASK                 ((uint32_t)0xFFFFFFFFU)         /* !< Data */

/* AESADVHP_TAG0 Bits */
/* AESADVHP_TAG0[DATA] Bits */
#define AESADVHP_TAG0_DATA_OFS                   (0)                             /* !< DATA Offset */
#define AESADVHP_TAG0_DATA_MASK                  ((uint32_t)0xFFFFFFFFU)         /* !< For a CPU read operation, these
                                                                                    registers contain the last 128-bit
                                                                                    TAG output of the EIP-39; the TAG is
                                                                                    available until the next context is
                                                                                    written. This register will only
                                                                                    contain valid data if the TAG is
                                                                                    available, when the
                                                                                    saved_context_ready or get_digest bit
                                                                                    from AES_CTRL register is set. In
                                                                                    case of get_digest, the output will
                                                                                    be an intermediate TAG for CCM or GCM
                                                                                    operation continuation. During
                                                                                    processing or for operations/modes
                                                                                    that do not return a TAG, reads from
                                                                                    this register returns data from the
                                                                                    IV register. For operations that do
                                                                                    return a TAG in the IV register, the
                                                                                    IV register must be accessed
                                                                                    directly. */

/* AESADVHP_TAG1 Bits */
/* AESADVHP_TAG1[DATA] Bits */
#define AESADVHP_TAG1_DATA_OFS                   (0)                             /* !< DATA Offset */
#define AESADVHP_TAG1_DATA_MASK                  ((uint32_t)0xFFFFFFFFU)         /* !< For a CPU read operation, these
                                                                                    registers contain the last 128-bit
                                                                                    TAG output of the EIP-39; the TAG is
                                                                                    available until the next context is
                                                                                    written. This register will only
                                                                                    contain valid data if the TAG is
                                                                                    available, when the
                                                                                    saved_context_ready or get_digest bit
                                                                                    from AES_CTRL register is set. In
                                                                                    case of get_digest, the output will
                                                                                    be an intermediate TAG for CCM or GCM
                                                                                    operation continuation. During
                                                                                    processing or for operations/modes
                                                                                    that do not return a TAG, reads from
                                                                                    this register returns data from the
                                                                                    IV register. For operations that do
                                                                                    return a TAG in the IV register, the
                                                                                    IV register must be accessed
                                                                                    directly. */

/* AESADVHP_TAG2 Bits */
/* AESADVHP_TAG2[DATA] Bits */
#define AESADVHP_TAG2_DATA_OFS                   (0)                             /* !< DATA Offset */
#define AESADVHP_TAG2_DATA_MASK                  ((uint32_t)0xFFFFFFFFU)         /* !< For a CPU read operation, these
                                                                                    registers contain the last 128-bit
                                                                                    TAG output of the EIP-39; the TAG is
                                                                                    available until the next context is
                                                                                    written. This register will only
                                                                                    contain valid data if the TAG is
                                                                                    available, when the
                                                                                    saved_context_ready or get_digest bit
                                                                                    from AES_CTRL register is set. In
                                                                                    case of get_digest, the output will
                                                                                    be an intermediate TAG for CCM or GCM
                                                                                    operation continuation. During
                                                                                    processing or for operations/modes
                                                                                    that do not return a TAG, reads from
                                                                                    this register returns data from the
                                                                                    IV register. For operations that do
                                                                                    return a TAG in the IV register, the
                                                                                    IV register must be accessed
                                                                                    directly. */

/* AESADVHP_TAG3 Bits */
/* AESADVHP_TAG3[DATA] Bits */
#define AESADVHP_TAG3_DATA_OFS                   (0)                             /* !< DATA Offset */
#define AESADVHP_TAG3_DATA_MASK                  ((uint32_t)0xFFFFFFFFU)         /* !< For a CPU read operation, these
                                                                                    registers contain the last 128-bit
                                                                                    TAG output of the EIP-39; the TAG is
                                                                                    available until the next context is
                                                                                    written. This register will only
                                                                                    contain valid data if the TAG is
                                                                                    available, when the
                                                                                    saved_context_ready or get_digest bit
                                                                                    from AES_CTRL register is set. In
                                                                                    case of get_digest, the output will
                                                                                    be an intermediate TAG for CCM or GCM
                                                                                    operation continuation. During
                                                                                    processing or for operations/modes
                                                                                    that do not return a TAG, reads from
                                                                                    this register returns data from the
                                                                                    IV register. For operations that do
                                                                                    return a TAG in the IV register, the
                                                                                    IV register must be accessed
                                                                                    directly. */

/* AESADVHP_STATUS Bits */
/* AESADVHP_STATUS[KEYWR] Bits */
#define AESADVHP_STATUS_KEYWR_OFS                (0)                             /* !< KEYWR Offset */
#define AESADVHP_STATUS_KEYWR_MASK               ((uint32_t)0x00000001U)         /* !< Key write status. 0 - user write to
                                                                                    KEY register is allowed. 1 - user
                                                                                    write to KEY register is ignored. In
                                                                                    order to allow user write, perform a
                                                                                    module reset. */
#define AESADVHP_STATUS_KEYWR_ENABLED            ((uint32_t)0x00000000U)         /* !< User write to KEY MMR is allowed */
#define AESADVHP_STATUS_KEYWR_DISABLED           ((uint32_t)0x00000001U)         /* !< User write to KEY MMR is disabled.
                                                                                    Writing has no effect. */

/* AESADVHP_DATA_IN Bits */
/* AESADVHP_DATA_IN[DATA] Bits */
#define AESADVHP_DATA_IN_DATA_OFS                (0)                             /* !< DATA Offset */
#define AESADVHP_DATA_IN_DATA_MASK               ((uint32_t)0xFFFFFFFFU)         /* !< Data input word */

/* AESADVHP_DATA_OUT Bits */
/* AESADVHP_DATA_OUT[DATA] Bits */
#define AESADVHP_DATA_OUT_DATA_OFS               (0)                             /* !< DATA Offset */
#define AESADVHP_DATA_OUT_DATA_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< Data output word */

/* AESADVHP_FORCE_IN_AV Bits */
/* AESADVHP_FORCE_IN_AV[DATA] Bits */
#define AESADVHP_FORCE_IN_AV_DATA_OFS            (0)                             /* !< DATA Offset */
#define AESADVHP_FORCE_IN_AV_DATA_MASK           ((uint32_t)0xFFFFFFFFU)         /* !< Any write to this register forces
                                                                                    the input data buffer to valid and
                                                                                    will force the engine to start
                                                                                    processing this data. The data
                                                                                    written here is not used. The core
                                                                                    must be configured to have input and
                                                                                    output data acknowledge be I/O
                                                                                    register based */

/* AESADVHP_CCM_ALN_WRD Bits */
/* AESADVHP_CCM_ALN_WRD[DATA] Bits */
#define AESADVHP_CCM_ALN_WRD_DATA_OFS            (0)                             /* !< DATA Offset */
#define AESADVHP_CCM_ALN_WRD_DATA_MASK           ((uint32_t)0xFFFFFFFFU)         /* !< This register provides a means to
                                                                                    access an internal EIP-39 register
                                                                                    that stores alignment data bytes
                                                                                    during the AAD phase of AES-CCM
                                                                                    processing. This register needs to be
                                                                                    read and stored when an AES-CCM
                                                                                    operation is interrupted during the
                                                                                    AAD phase. This value needs to be
                                                                                    restored by writing this register,
                                                                                    when resuming that AES-CCM operation
                                                                                    in a later session. */

/* AESADVHP_BLK_CNT0 Bits */
/* AESADVHP_BLK_CNT0[DATA] Bits */
#define AESADVHP_BLK_CNT0_DATA_OFS               (0)                             /* !< DATA Offset */
#define AESADVHP_BLK_CNT0_DATA_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< Internal block counter for AES GCM
                                                                                    and CCM operations. These bits read
                                                                                    the block count value that represents
                                                                                    the number of blocks to go. This
                                                                                    value is valid with
                                                                                    saved_context_ready after a request
                                                                                    for an intermediate GCM/CCM digest.
                                                                                    Writing these registers will restore
                                                                                    the internal block counter to the
                                                                                    programmed value. This only needs to
                                                                                    be done to prepare the engine to
                                                                                    continue processing of an interrupted
                                                                                    GCM or CCM operation. Also refer to
                                                                                    the get_digest and gcm_ccm_continue
                                                                                    bits in AES_CTRL register. */

/* AESADVHP_BLK_CNT1 Bits */
/* AESADVHP_BLK_CNT1[DATA] Bits */
#define AESADVHP_BLK_CNT1_DATA_OFS               (0)                             /* !< DATA Offset */
#define AESADVHP_BLK_CNT1_DATA_MASK              ((uint32_t)0x00FFFFFFU)         /* !< Internal block counter for AES GCM
                                                                                    and CCM operations. These bits read
                                                                                    the block count value that represents
                                                                                    the number of blocks to go. This
                                                                                    value is valid with
                                                                                    saved_context_ready after a request
                                                                                    for an intermediate GCM/CCM digest.
                                                                                    Writing these registers will restore
                                                                                    the internal block counter to the
                                                                                    programmed value. This only needs to
                                                                                    be done to prepare the engine to
                                                                                    continue processing of an interrupted
                                                                                    GCM or CCM operation. Also refer to
                                                                                    the get_digest and gcm_ccm_continue
                                                                                    bits in AES_CTRL register. */

/* AESADVHP_DMA_HS Bits */
/* AESADVHP_DMA_HS[DMA_DATA_ACK] Bits */
#define AESADVHP_DMA_HS_DMA_DATA_ACK_OFS         (0)                             /* !< DMA_DATA_ACK Offset */
#define AESADVHP_DMA_HS_DMA_DATA_ACK_MASK        ((uint32_t)0x00000001U)         /* !< When this bit is 0b, input and
                                                                                    output data acknowledge is I/O
                                                                                    register based, as specified in the
                                                                                    description of the AES_DATA_IN_n /
                                                                                    AES_DATA_OUT_n registers. When this
                                                                                    bit is 1b, input and ouput data
                                                                                    acknowledge is based on DMA handshake
                                                                                    signals. */
#define AESADVHP_DMA_HS_DMA_DATA_ACK_DMA_DISABLE ((uint32_t)0x00000000U)         /* !< Disable DMA based data handshake */
#define AESADVHP_DMA_HS_DMA_DATA_ACK_DMA_ENABLE  ((uint32_t)0x00000001U)         /* !< Enables DMA based handshake */

/* AESADVHP_OPTIONS Bits */
/* AESADVHP_OPTIONS[DATA] Bits */
#define AESADVHP_OPTIONS_DATA_OFS                (0)                             /* !< DATA Offset */
#define AESADVHP_OPTIONS_DATA_MASK               ((uint32_t)0xFFFFFFFFU)         /* !< Data */

/* AESADVHP_VERSION Bits */
/* AESADVHP_VERSION[DATA] Bits */
#define AESADVHP_VERSION_DATA_OFS                (0)                             /* !< DATA Offset */
#define AESADVHP_VERSION_DATA_MASK               ((uint32_t)0xFFFFFFFFU)         /* !< Data */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_aesadvhp__include */

